Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/K47A.tmx
Source language: en_us
Languages: zh_cn

source: The Card
zh_cn: 贺卡

source: The only thing I ever got off my old man was a birthday card when I was ten.
zh_cn: 我从我老头子那里得到的唯一一样东西是我十岁时的一张贺卡。

source: He'd gone off when I was three and left me and mam and my sister to fend for ourselves.
zh_cn: 他在我三岁时离开了，留下我和老妈、姐姐自力更生。

source: Mam never talks about him but my sister remembers him.
zh_cn: 老妈从没谈起过他，不过姐姐却记得他。

source: "What was dad like?" I ask.
zh_cn: “老爸是什么样的？”我问。

source: She looks at me through dark, sleepy eyes, pushes her hair back from her eyes.
zh_cn: 她透过黑色困倦的眼睛看着我，把头发从眼睛处向后推。

source: Her arms are scabbed like she's been shinning up a rusty drainpipe and accidentally slid back down and scraped herself.
zh_cn: 她的胳膊上满是痂疤，仿佛她在擦一个生锈的排水管时意外地滑倒擦伤了自己似的。

source: "Whu?"
zh_cn: “嗯？”

source: "I said, what was dad like?"
zh_cn: “我说，老爸是什么样的？”

source: he smiles at me, and I suss that she's still trippin' and I should ask her later when she's straight.
zh_cn: 她对我微笑，我推测她还处在迷幻状态，我应该稍后在她不受毒品影响时问她。

source: Anyhow, the only thing I ever got from him was a birthday card when I was ten.
zh_cn: 不管怎样，我从他那里得到的唯一一样东西是我十岁时的一张生日贺卡。

source: It said Happy Birthday Mickey!
zh_cn: 上面写着生日快乐米奇（Mickey）！

source: And then there was a verse inside the card that went:
zh_cn: 而且在贺卡里面还有一首诗，这样写道：

source: Now you're ten, and how you've grown
zh_cn: 现在你十岁了，你是怎么长大的

source: It really won't be long
zh_cn: 其实用不了多久

source: "Til you're a man, and fully grown
zh_cn: 你就会成为一个男子汉，完全长大

source: With arms both big and strong.
zh_cn: 有强壮粗大的臂膀

source: And on the front of the card was a picture, a cartoon, of a little boy wearing a hardhat and driving a tractor.
zh_cn: 在贺卡的正面有一幅画，一幅卡通画，是一个小男孩戴着一个安全帽在开一辆拖拉机。

source: But I mean, how would he know I'd grown?
zh_cn: 但我的意思是，他怎么会知道我长大了？

source: To be honest, I was surprised he knew where I was, we moved so often.
zh_cn: 说实话，我感到惊讶的是他知道我在哪里，我们搬家搬得这么勤。

source: But the killer was, at the bottom of the card, below the rhyme, he'd added:
zh_cn: 但要命的是，在贺卡的底部，在那首诗的下面，他又加上：

source: Remember, no one's got your back
zh_cn: 记住，没有人帮你

source: XX. Dad.
zh_cn: XX，老爸。

source: I'd studied this card on more than one occasion, trying to work out some depth to what he was telling me. 'Laura, what was dad like?"
zh_cn: 我不止一次研究这张贺卡，试图深入一点儿弄明白他在跟我说什么。“劳拉（Laura），老爸是什么样的？”

source: Three hours later and she's washing up.
zh_cn: 三个小时后，她在洗碗碟。

source: The dutiful daughter.
zh_cn: 这个孝顺的女儿。

source: She looked up a little, thought about my question for a second or two.
zh_cn: 她稍稍抬头向上看看，考虑了一两秒钟我的问题。

source: Then she said, "I love him.
zh_cn: 然后她说：“我爱他。

source: Still."
zh_cn: 依旧。”

source: "Well I hate him.
zh_cn: “噢，我恨他。

source: What was he like, though?"
zh_cn: 不过，他是什么样的？”

source: And she said, "Stern."
zh_cn: 她说：“严格。”

source: "Stern, huh?"
zh_cn: “严格，呃？”

source: "I don't mean strict; more like serious.
zh_cn: “我的意思不是说严厉；更像是严肃。

source: Like you, a bit, but smarter, taller and better looking."
zh_cn: 就像你，有一点点，但是更聪明、更高、更好看。”

source: Then she laughed and slapped me across the arm, "Dry the dishes," she said.
zh_cn: 然后她大笑起来，拍拍我的胳膊，“把盘子擦干，”她说。

source: It's funny, I learn a lot from my sister, mainly don't do drugs, which I should have written in capital letters instead of italics, but never mind, the thing is, when she's not high or shaking 'cos she needs some stuff, she's really smart and, truth be told, she's the core of our family, the strength, believe it or not.
zh_cn: 好笑的是，我从我姐姐那儿学到很多东西，主要是不要沾毒品，这个我本应该用大写字母代替斜体字来写的，但是没关系，最重要的是，在她没有因为需要一些毒品而亢奋或颤抖时，她真的很聪明，而且说真的，她是我们家庭的核心，是力量的来源，信不信由你。

source: Honest, she keeps us together.
zh_cn: 老实说，她把我们维系在一起。

source: There's me, fifteen, bright, got a future, they tell me, though I haven't and I'll tell you about that later, and then there's my mam, as honest as, and working, and sensible (though not in her choice of boyfriends or anything) and all that stuff.
zh_cn: 至于我，十五岁，聪明，有前途，他们告诉我的，尽管我没有，这些我以后再告诉你。然后还有我老妈，一样的坦率，有工作，明智（尽管不是在她选择男朋友或任何事情上）和所有那些东西。

source: And then there's Laura. Nineteen, and a junkie, but she holds the family together.
zh_cn: 然后还有劳拉，十九岁，吸毒，但她把一家人团结在一起。

source: Cos mam's a flake and useless, and I, basically, am at a loose end; financially, educationally, socially, morally...
zh_cn: 因为老妈是一个有怪癖的人，又没什么用，而我基本上是吊儿郎当的，在经济上、教育上、社会地位上、道德上......

source: I won't go on.
zh_cn: 我不继续说下去了。

source: Laura has one thing going for her; she's honest.
zh_cn: 劳拉有一个优点，她诚实。

source: And because she is honest she sees more than most, so she knows more than most, and she holds me and mam together.
zh_cn: 正因为她诚实，她看到的比大部分人多，所以她知道的比大部分人多，她把我和老妈维系在一起。

source: Mam.
zh_cn: 老妈。

source: Hold on, I was told by my English teacher, Miss Wright, that I should show, not tell; 'too much exposition,' she'll say to me (look it up).
zh_cn: 等等，我的英语老师赖特（Wright）小姐跟我说，我应该展示而不是讲述“太多的解释说明”，她会对我说（查一查）。

source: So maybe I should stop describing my life, start showing what happens instead, but I'll get to that bit in a bit, so to speak.
zh_cn: 所以或许我应该停止描述我的生活，改为开始展示发生了什么，但是过一会儿我就要达到那一点了，可以这么说。

source: Ok, so mam. My mother. She is thirty seven years old and she is a flake. A total dribble. Weak as.
zh_cn: 好吧，那么老妈，我母亲，她三十七岁，是一个怪人，一个十足的废物，懦弱无能。

source: They should do a reality TV show on my mam - "How Not To ..."
zh_cn: 他们应该给我老妈做一个电视真人秀——“如何不......”

source: "How Not To bring up your children."
zh_cn: “如何不抚养孩子。”

source: "How Not To save for the future."
zh_cn: “如何不为将来储蓄。”

source: "How Not To get a good job."
zh_cn: “如何不得到一个好工作。”

source: "How Not To attract a nice boyfriend."
zh_cn: “如何不吸引一个好的男朋友。”

source: She did once. Attract a nice boyfriend, that is.
zh_cn: 她确实有一次做到了，就是说，吸引了一个好的男朋友。

source: And I've read all the women's magazines she buys and I knew from the off it wasn't going to last. From the moment she said to me, 'He's kind, thoughtful, good looking.
zh_cn: 我读过了她买的所有女性杂志，我从一开始就知道他们不会持久，从她对我说的那一刻起：“他亲切、体贴、英俊。

source: He's got a good job, Pete, and a lovely car' (a bloody good car, since you ask.
zh_cn: 他有一份好工作，皮特（Pete），还有一辆漂亮的车（一辆非常好的车，既然你问了。

source: You didn't?
zh_cn: 你没问？

source: But you would have.
zh_cn: 但你本来要问的。

source: A Kompressor. Which means Supercharger. Which also means money. Cool. German. Cool. And much more).
zh_cn: 一个机械增压（Kompressor）型，它的意思是增压器，也意味着钱。酷，德国的，酷，还有更多的）。”

source: But anyway, as she's telling me all this I'm thinking, Yeah, but mam, you're going to fall for a skinheaded nightclub doorman or a carpet salesman called Wayne and you're going to jack Pete in and tell me 'there was no spark' which translates as, you think that love equals pain, and affection means distress and you think that being nice is the equivalent of being invisible.
zh_cn: 但是不管怎样，在她告诉我所有这些时，我在想，是的，但是老妈，你将要爱上一个光头的夜总会门卫或一个叫韦恩（Wayne）的地毯推销员，你将要甩了皮特，告诉我“没有火花”，这说明，你认为爱等于痛苦、喜爱意味着忧伤，你认为好相当于不引人注目。

source: Which it kind of is.
zh_cn: 类似这个意思吧。

source: So just be honest.
zh_cn: 所以请只要诚实。

source: Please. So, as predicted, Pete went the journey.
zh_cn: 因此，不出所料，皮特去旅行了。

source: Kompressor and all.
zh_cn: 机械增压型及所有一切。

source: And in moved Marc.
zh_cn: 然后马克（Marc）搬了进来。

source: Fifteen years younger than mam.
zh_cn: 比老妈年轻十五岁。

source: What a tosspot.
zh_cn: 好一个酒鬼。

source: What a racket.
zh_cn: 好一个混混。

source: It was embarrassing.
zh_cn: 真令人尴尬。

source: It was the crime that no parent should inflict upon their children!
zh_cn: 那是没有哪一位父母应该带给孩子的罪行！

source: Making those noises.
zh_cn: 发出那些声音。

source: I was twelve, which made Laura sixteen; she'd just failed her exams and was working in Safeway.
zh_cn: 我十二岁，也就是说劳拉十六岁了；她刚刚考试不及格，正在西夫韦（Safeway，美国连锁超市）工作。

source: Very content. Regular money, dreaming about her own flat. Boyfriend.
zh_cn: 很满足，定期的薪水，梦想着她自己的公寓，男朋友。

source: And the last thing that Laura wanted was mam and Marc doing that upstairs halfway through a Sunday afternoon.
zh_cn: 劳拉最不希望的事情是老妈和马克在星期天下午中间时在楼上做那个。

source: Go on mam; be a mam, not a flake. Don't be desperate, please.
zh_cn: 来吧老妈；拿出一个妈妈的样儿来，不要做一个古怪的人，请不要绝望。

source: But no.
zh_cn: 但是不。

source: And when Marc made a play for Laura one afternoon, just a suggestion you understand, she screamed the place down and mam came dashing downstairs half-dressed and slapped Laura to shut her up and then slapped her again when she heard what she was accusing Marc of doing.
zh_cn: 某天下午当马克引诱劳拉时，只是一个暗示行为，你懂的，她报告了警察，老妈衣服穿了一半就冲下楼，掌掴劳拉让她闭嘴，然后当她听到她指责马克做了什么时又掌掴她。

source: I'm not tough, really, I'm not.
zh_cn: 我不强硬，真的，我不。

source: And I'm not pretending to be not tough so you'll think that really I secretly am tough either.
zh_cn: 我也不假装不强硬，因此你会认为我实际上背地里是强硬的。

source: I'm just not.
zh_cn: 我只是不。

source: So when mam took his side against Laura I couldn't drop Marc with a right hook to the jaw or a knee in the family jewels, though I really, really wanted to, so I just went and sat on the front step and listened to them row.
zh_cn: 所以当老妈帮着他对付劳拉时，我不能给马克的下巴一记右钩拳或用膝盖撞一下他传宗接代的宝贝把他撂倒，尽管我真的、真的想，所以我只是离开坐在前面台阶上听他们吵架。

source: It was one of those afternoons with dark and light grey clouds flying across the sky on the wind (scudding, as they say in really old novels).
zh_cn: 那是乌云和浅灰色云团随风飞过天空（行云，如他们在真正古老的小说里说的那样）的那些下午中的一个。

source: I sat on the step of our front door watching the seagulls wheel and fly and sail on the wind.
zh_cn: 我坐在我们前门的台阶上看海鸥乘风盘旋、飞翔、飘游。

source: I wished I could do that.
zh_cn: 我希望我也能那么做。

source: I have this theory that, to us the world is a flat thing we stand on, but to birds it is a cliff they cling to, a huge ball and they cling to the side and then fall off and fly and glide.
zh_cn: 我有一种想法，就是对我们来说世界是一个我们所站立的平坦的东西，而对鸟来说是一个它们所依靠的峭壁，一个巨大的球，它们依靠在边上，然后离开、飞翔、滑行。

source: I'm digressing here, but I can't remember what else happened, except I know how it ended.
zh_cn: 我在这儿跑题了，但我记不起发生了其他什么事，除了我知道它是如何结束的之外。

source: The next morning I waited until Marc went out and then I used mam's phone to call the police and grass Marc for the twenty grams of cocaine he had stashed in a haversack under the stairs.
zh_cn: 第二天早上我等到马克出去了，然后我用老妈的电话报警，告发马克在楼梯下一个帆布背包里藏了20克可卡因。

source: Bingo.
zh_cn: 成了。

source: Job done.
zh_cn: 完工。

source: Like I say, I'm not tough.
zh_cn: 正如我说的，我不强硬。

source: But I don't need to be when there's five polis and a German Shepherd dog breaking down the door and dragging Marc screaming down the path and into a van.
zh_cn: 但是在五个警察和一条德国牧羊犬闯进门一路把尖叫的马克拖进一辆厢式汽车时，我也不需要强硬。

source: Anyhow, this card I got from my dad.
zh_cn: 不管怎样，这张贺卡是我从我老爸那儿得到的。

source: It said, remember, no one's got your back, like this was some piece of information I'd known but had forgotten, or like I already had asked someone to get my back and then discovered they hadn't got it, or something.
zh_cn: 上面说，记住，没有人帮你，好像这是我已知的某条知识但是忘记了，或者好像我已经请求某些人帮我，然后发现他们没帮，或者某些东西。

source: I mean, come on dad, I don't know who you are, or where you are or what you do or anything, but come on, be a dad for a minute. For as long as it takes not to write that sentence.
zh_cn: 我意思是，来吧老爸，我不知道你是谁，或者你在哪里或者你做什么或者任何事情，但是来吧，做一分钟爸爸，用不写那个句子所花费的那么长的时间。

source: I was ten years old for Chrissake.
zh_cn: 看在上帝份上，我十岁了。

source: Write I miss you or We'll meet up when you're older or Stick in at school.
zh_cn: 写我想念你或者你再大些时候我们会见面或者在学校好好学习。

source: In fact, here's an idea.
zh_cn: 事实上，这儿有一个主意。

source: Don't send me a card.
zh_cn: 不要给我寄一张贺卡。

source: Go on.
zh_cn: 来吧。

source: Unsend it.
zh_cn: 不要寄。

source: But the funny thing is, daft, one-off card with a stupid picture and a deranged verse it might have been.
zh_cn: 不过好玩的事情是，傻乎乎的、仅送过这一次的带有一幅没什么意义的图画的贺卡和一首可能是的疯疯颠颠的诗。

source: But he was right.
zh_cn: 但他是对的。

source: No one's got your back.
zh_cn: 没有人帮你。
